Revit 2024 API
InitialColor.Clone Method
 Creates a copy of the InitialColor derived object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialColor Clone()
Visual Basic
Public Function Clone As InitialColor
Visual C++
public:
InitialColor^ Clone()
See Also
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace